
//`status`  '主订单状态(0待支付     1待接单 2 已接单(待提货) 3已提货 (送货中)  4已送达 5已确认收货    6已取消  )',
//`pay_status` '支付状态(0 未处理 1支付中 2 支付成功 3 支付失败 4退款中 5退款成功 6 退款失败)',
//`status`  '子订单状态(0 未取货 1已取货 2已取消)',
//`pay_status`  '子订单支付状态(0 未处理1 退款中 2 已退款 3退款失败)'

const OrderStatus= { //key: _主订单状态_支付状态
    "_0_*": "待支付",
    "_1_*": "订单已提交，捎带者待接单",
    "_2_*": "捎带者已接单，等待提货",
    "_3_*": "捎带者已提货，等待收货",
    "_4_*": "已送达",
    "_5_*": "已收货，订单已完成", 
    "_6_0": "未支付，已取消",
    "_6_*": "捎带者取消接单",
    "_6_4": "捎带者取消接单，退款中",
    "_6_5": "捎带者取消接单，已退款成功",
    "_6_6": "捎带者取消接单，退款失败",

    "_0_*_find": "待支付",
    "_1_*_find": "订单已提交，捎带者待接单",
    "_1_4_find": "订单已取消，退款中",
    "_2_*_find": "捎带者已接单，等待提货",
    "_3_*_find": "捎带者已提货，等待收货",
    "_4_*_find": "已送达",
    "_5_*_find": "已收货，订单已完成",
    "_6_0_find": "未支付，已取消",
    "_6_*_find": "订单已取消",
    "_6_4_find": "订单已取消，退款中",
    "_6_5_find": "订单已取消，退款成功",
    "_6_6_find": "订单已取消，退款失败",

}

const OrderStatusWith= { //key: _主订单状态_支付状态
    "_0_*": "待支付",
    "_1_*": "待接单",
    "_2_*": "已接单，待提货",
    "_3_*": "已提货，待送达",
    "_4_*": "已送达",
    "_5_*": "买家已签收，订单已完成",
    "_6_*": "已取消",
    "_6_4": "已取消，退款中",
    "_6_5": "已取消，退款成功",
    "_6_6": "已取消，退款失败"
}

const replaceStatusLocal= function(status, payStatus, from, ){
    /*
    * @Author: denghuaicheng 
    * @Date: 2019-03-22 10:23:37 
 * @Last Modified by: denghuaicheng
 * @Last Modified time: 2019-03-22 10:43:23
    * 00- 09 : 主订单 未支付 状态范围
    * 10- 19 : 主订单 待接单 状态范围
    * 20- 29 : 主订单 已接单 状态范围
    * 30- 39 : 主订单 待送达 状态范围
    * 40- 49 : 主订单 已送达 状态范围
    * 50- 59 : 主订单 已签收 状态范围
    * 60- 69 : 主订单 已取消 状态范围
    */
    
    return status* 10+ payStatus

}

export {
    OrderStatus, OrderStatusWith
}